using DomainModelCommon;

namespace BBBEntity.ValueObject
{
    /// <summary>
    /// BBB設定の値オブジェクトクラス
    /// </summary>
    /// <param name="Value">設定値</param>
    public record BBBVO(string Value) : ValueObjectBase<string>(Value), IInputLimit<string>
    {
        #region Constants -------------------------------------------------------------------------------------

        private const TextFormatType Type = TextFormatType.HalfWidthAlphanumeric;

        #endregion --------------------------------------------------------------------------------------------

        #region Fields ----------------------------------------------------------------------------------------

        #endregion --------------------------------------------------------------------------------------------

        #region Properties ------------------------------------------------------------------------------------

        #endregion --------------------------------------------------------------------------------------------

        #region Events ----------------------------------------------------------------------------------------

        #endregion --------------------------------------------------------------------------------------------

        #region Constructor -----------------------------------------------------------------------------------

        #endregion --------------------------------------------------------------------------------------------

        #region Methods - public ------------------------------------------------------------------------------

        /// <inheritdoc/>
        public static string CurrectValue(string value)
        {
            string ret = value;

            if (!IsValid(value))
            {
                if (!value.IsFormatValid(Type))
                {
                    ret = ret.ExtractOnlyAbailableCharacters(Type);
                }
            }

            return ret;
        }

        /// <inheritdoc/>
        public static bool IsValid(string value)
        {
            if (!value.IsFormatValid(Type))
            {
                return false;
            }

            return true;
        }

        #endregion --------------------------------------------------------------------------------------------

        #region Methods - internal ----------------------------------------------------------------------------

        #endregion --------------------------------------------------------------------------------------------

        #region Methods - protected ---------------------------------------------------------------------------

        #endregion --------------------------------------------------------------------------------------------

        #region Methods - private -----------------------------------------------------------------------------

        #endregion --------------------------------------------------------------------------------------------

        #region Methods - override ----------------------------------------------------------------------------

        /// <inheritdoc/>
        protected override void Validate()
        {
            // TODO K.I : overrideを整頓
            if (!IsValid(Value))
            {
                throw new ArgumentException("Invalid Value", nameof(Value));
            }
        }

        #endregion --------------------------------------------------------------------------------------------

        #region Inner Class/Enum/etc. -------------------------------------------------------------------------

        #endregion --------------------------------------------------------------------------------------------
    }
}
